# use this for every sem? prob no need for sem, subject template?
***** DONE [#B] [[https://replit.com/@bca-fourth-semester1/Assignment-JS-Problems-dinesh-58#index.js][js problems]]
SCHEDULED: <2023-04-04 Tue> DEADLINE: <2023-04-08 Sat>
:LOGBOOK:
CLOCK: [2023-04-04 Tue 19:40]--[2023-04-04 Tue 20:13] =>  0:33
CLOCK: [2023-04-04 Tue 19:18]--[2023-04-04 Tue 19:36] =>  0:18
CLOCK: [2023-04-01 Sat 18:57]--[2023-04-01 Sat 20:06] =>  1:09
:END:
****** [#A] complete form validation program
SCHEDULED: <2023-05-24 Wed>
:LOGBOOK:
CLOCK: [2023-05-24 Wed 19:32]--[2023-05-24 Wed 20:36] =>  1:04
CLOCK: [2023-05-24 Wed 17:43]--[2023-05-24 Wed 18:55] =>  1:12
CLOCK: [2023-05-24 Wed 13:16]--[2023-05-24 Wed 14:02] =>  0:46
:END:
[[https://docs.google.com/document/d/16HJJ9trU1zYMn648dJ1jpJg2dV2jvc6XaNtZN-XhAKU/edit][details]]
[[https://classroom.google.com/c/NTE3MjE4Mjk1NDAw/a/NjEwNzg5NDYwMTMx/details][submission link]]

******* finish css for home page
:LOGBOOK:
CLOCK: [2023-05-25 Thu 10:17]--[2023-05-25 Thu 11:03] =>  0:46
CLOCK: [2023-05-25 Thu 09:50]--[2023-05-25 Thu 10:08] =>  0:18
:END:
- [X] button border
- [X] button hover
  
***** DONE [[file:project-1/proposal/bca-project-proposal-sujal-34.org][project proposal]] 
DEADLINE: <2023-04-25 Tue -2d>
:LOGBOOK:
CLOCK: [2023-04-23 Sun 18:15]--[2023-04-23 Sun 20:23] =>  2:08
CLOCK: [2023-04-23 Sun 17:22]--[2023-04-23 Sun 17:45] =>  0:23
CLOCK: [2023-04-22 Sat 20:07]--[2023-04-22 Sat 20:31] =>  0:24
CLOCK: [2023-04-22 Sat 18:30]--[2023-04-22 Sat 19:10] =>  0:40
CLOCK: [2023-04-20 Thu 20:16]--[2023-04-20 Thu 20:40] =>  0:24
CLOCK: [2023-04-20 Thu 19:25]--[2023-04-20 Thu 20:15] =>  0:50
CLOCK: [2023-04-20 Thu 18:38]--[2023-04-20 Thu 19:21] =>  0:43
CLOCK: [2023-04-20 Thu 18:23]--[2023-04-20 Thu 18:38] =>  0:15
CLOCK: [2023-04-19 Wed 20:35]--[2023-04-19 Wed 21:00] =>  0:25
CLOCK: [2023-04-19 Wed 17:21]--[2023-04-19 Wed 18:21] =>  1:00
CLOCK: [2023-04-19 Wed 17:05]--[2023-04-19 Wed 17:21] =>  0:16
CLOCK: [2023-04-19 Wed 16:57]--[2023-04-19 Wed 17:05] =>  0:08
CLOCK: [2023-04-19 Wed 15:56]--[2023-04-19 Wed 16:34] =>  0:38
CLOCK: [2023-04-19 Wed 15:17]--[2023-04-19 Wed 15:37] =>  0:20
CLOCK: [2023-04-19 Wed 14:20]--[2023-04-19 Wed 14:49] =>  0:29
CLOCK: [2023-04-16 Sun 20:06]--[2023-04-16 Sun 20:50] =>  0:44
CLOCK: [2023-04-16 Sun 14:04]--[2023-04-16 Sun 14:10] =>  0:06
CLOCK: [2023-04-16 Sun 12:55]--[2023-04-16 Sun 13:33] =>  0:38
CLOCK: [2023-04-15 Sat 19:01]--[2023-04-15 Sat 19:45] =>  0:44
CLOCK: [2023-04-15 Sat 18:35]--[2023-04-15 Sat 18:56] =>  0:21
CLOCK: [2023-04-12 Wed 19:23]--[2023-04-12 Wed 19:30] =>  0:07
CLOCK: [2023-04-04 Tue 17:46]--[2023-04-04 Tue 18:51] =>  1:05
CLOCK: [2023-04-04 Tue 17:33]--[2023-04-04 Tue 17:38] =>  0:05
:END:
- [X] instead of making todos for everything, just start working?
